###############################################################
#  Generated by:      Cadence Innovus 22.10-p001_1
#  OS:                Linux x86_64(Host ID vlsicad)
#  Generated on:      Wed Oct  8 17:30:28 2025
#  Design:            FFT
#  Command:           saveDesign FFT_DESIGN_LIBRARY/route_design.inn
###############################################################
current_design FFT
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 8.000000 -waveform {0.000000 4.000000}
set_propagated_clock  [get_clocks {clk}]
set_max_transition -clock_path 0.75  [get_clocks {clk}]
set_max_transition -data_path 1.5  [get_clocks {clk}]
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_max_fanout 30  [get_designs {FFT}]
set_clock_uncertainty  0.01 [get_ports {clk}]
